{
  "title": "Chapter 3: Professionalism in computing ",
  "cells": [
    {
      "type": "markdown",
      "data": "*Questions that we should be able to develop: (hasta lo que hemos dado ahora)* \n\n1. IT worker and IT related workers? \n2. Categorization of IT workers (developer, conceptualisers...)\n3. International Standard Classification of IT Occupations (ILO) \n4. The concept of T-shaped skills \n5. The rate of ICT profession in industry \n6. ICT-based industry \n7. The need of technological vigilance\n8. ICT professional associations "
    },
    {
      "type": "markdown",
      "data": "#### ICT professional associations: \nThey take care of continuos training (formation) of their members in such a way they are updated. As well as legal aspects and problems. \nExamples of this associations include: ACM (Association of Computer Machinery). "
    },
    {
      "type": "markdown",
      "data": "### Training in the field of Information \n+ Vocational training\n    + Middle Grade Training Cycles and Superior-level Training Cycle \n+ Higher education \n+ Non-formal training\n    + Associations \n    + Private companies "
    },
    {
      "type": "markdown",
      "data": "### Internal Promotion\n+ In many cases, internal promotion of employees is preferred for new jobs or vacancies. \n+ Advantages: \n    + Very useful system to keep employees motivated\n    + Maintain a healthy perspective that this can boost your professional career\n+ Disadvantages: \n    + Competences may change and the person may not be able to handle the new job\n    + The competences which are good at this level are not always good at another"
    },
    {
      "type": "markdown",
      "data": "### Peter Principle \n+ In a Hierarchy every employee tends to Rise to his level of incompetence.\n+ Basically, it states that generally speaking incompetent workers will be promoted above competent workers to managerial positions where they don't have to do any real work and the damage they do can be limited. "
    },
    {
      "type": "markdown",
      "data": "### Competence\n+ The ability to do something successfully or efficiently\n+ The legal authority of a court or other body to deal with a particular matter \n+ Competence = Knowledge + experience + ability \n+ The concept of competence is also often referred as: \n    + **Motivation:** \n        + A reason(s) for acting or behaving in a particular way\n        + Desire or willingness to do something (enthusiam)\n    + **Attitude:** \n        + A settled way of thinking or feeling about something\n    + **Potential:** \n        + Latent qualities or abilities that may be developed and lead to future success or usefulness\n        + The possibility of something happening or of someone doing something in the future"
    },
    {
      "type": "markdown",
      "data": "Nowadays it has become fashionable to classify competences into: \n+ **Hard Skills**: referring to the technical work developed\n+ **Soft Skills**: related to emotional intelligence, collaboration, teamwork, leadership...\n+ The technical ones are high perishable, but not soft skills."
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    },
    {
      "type": "markdown",
      "data": ""
    }
  ]
}