{
  "title": "Untitled Note",
  "cells": [
    {
      "type": "markdown",
      "data": "# UNIT 9: DISTRIBUTED ALGORITHMS\n\n### Distributed Algorithms Re-cap:\n\n+ Independent of specific technologies\n+ Features of decentralized distributed algorithms:\n  + No node maintains all complete information required by the algorithm\n  + Nodes only take decisions based on their local knowledge\n  + The failure of one node does not prevent the algorithm to progress\n  + No global physical clock is assumed\n\n## Clocks\n\n#### Difficulties in temporal synchronization\n\n+ Synchronization provides mechanisms for coordinating activities.\n+ It is _more complex_ in distributed systems than in centralized ones (eg: access to shared resources)\n  + Centralized: Usual way to synchronize is using a single global clock\n  + Distributed: Each computer has its own clock\n+ To employ a single clock in distributed systems: we need to synchronize clocks of the different nodes to have a common clock\n\n#### Clock synchronization algorithm\n\n* Each node _i_ has a local clock _Ci_ \n  * It represents a universal temporal coordinated (UTC) value\n* Given any real instant _t_ \n  * The goal is that all nodes have _Ci(t) = t_ \n  * This means that all local clocks have the same time, and this time must be the same as the \"exact true right\" time\n* Unfortunately, clock chips in which _Ci_ clocks are based are not this precise\n  * They normally have a relative error of  $10^{-6}$ \n  * Therefore, _Ci(t)_ is more and more different from t\n* The solution is to periodically synchronize clocks of all nodes using some reliable time source\n\n#### Cristian Algorithm \n\nCristian Algorithm synchronizes the local clock **Cc** of a **client computer** with the local clock **Cs** of a **server computer** \n\n**Considerations:** \n\n+ The server computer has a very precise clock, possibly synchronized with others that are still more precise\n+ Clocks must no go back\n+ Synchronization implies message transmission, but transmission of messages through the network takes time\n\n##### Algorithm: \n\n+ The algorithm asks the value of the clock to the server at instant T0 (client local clock Cc)\n+ The server receives the request and answers with the value of its own clock: Cs\n+ The answer arrives to the client at T1 (Cc)\n+ The client sets its clock to the value **C = Cs + (T1 - T0)/2** \n  + If C > Cc => Cc = C\n  + If C < Cc => The client stops Cc the next Cc-C units of time \n    + Stores LAG = Cc - C and several clock ticks are discarded until LAG time has been elapsed\n\n__**Features:**__  \n\nIt assumes that the sending time of both messages (request and answer) is practically the same\n\n+ In _t1_ the value of Cs will have been incremented in (T1 - T2)/2 \n\nIf one of the two messages takes more time to be transmitted, then this adjustment is not right and so normally, the duration of both messages is the same. \n\nThe right \tbehavior of a distributed application can be dependent on the values of local clocks only if it can tolerate the error margin inherent to the synchronization algorithm applied.\n\n#### Berkeley Algorithm\n\n**Features:** \n\n+ There is a set of nodes composed of:\n  + A server, named S\n  + N clients, named *Ci* \n+ Each node has its own local clock \n+ The goal is to synchronize the local clocks of all nodes between them\n+ Periodically, at server initiative, all nodes synchronize their clocks\n\nThis algorithm does not assume any computer with a precise clock.\n\nBut one of the computers of the distributed system will act as a server and the others as its clients.\n\nThe server periodically broadcasts the value of its clock\n\n+ Each client answers with the difference between its local clock and the server's one\n\nGiven the replies, the server:\n\n1. Computes the average difference\n2. Updates its own clock\n3. Answers to every client with the difference that each of them has to apply in order to update its local clock\n\n\n\n"
    }
  ]
}